//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
// 
// /*++
// Copyright (c) 2014 - 2016 Intel Corporation. All rights reserved.
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// --*/
/=#

#include "Strings.uni"


//---------------------------------------------------------------------------
// IE Configuration
//---------------------------------------------------------------------------
#string STR_NO                                  #language en-US "No"
#string STR_YES                                 #language en-US "Yes"

//---------------------------------------------------------------------------
// Server IE Configuration
//---------------------------------------------------------------------------
#string STR_SERVER_IE_FORM                      #language en-US "Server IE Configuration"
#string STR_SERVER_IE_FORM_HELP                 #language en-US "Configure Server IE Parameters"
#string STR_SERVER_IE_FORM_TITLE                #language en-US "Server IE Configuration"
#string STR_SERVER_IE_SUBTITLE                  #language en-US "General IE Configuration"


#string STR_IEFS_HELP                           #language en-US "IE Firmware Status register in HECI-1 configuration space."
#string STR_IEFS_PROMPT                         #language en-US "IE Firmware Status"
#string STR_IEFS_VALUE                          #language en-US "N/A"

#string STR_IE_HECI1ENABLE_PROMPT               #language en-US "HECI-1 Enable"
#string STR_IE_HECI1ENABLE_HELP                 #language en-US "Override HECI-1 status on PCI"
#string STR_IE_HECI2ENABLE_PROMPT               #language en-US "HECI-2 Enable"
#string STR_IE_HECI2ENABLE_HELP                 #language en-US "Override HECI-2 status on PCI"
#string STR_IE_HECI3ENABLE_PROMPT               #language en-US "HECI-3 Enable"
#string STR_IE_HECI3ENABLE_HELP                 #language en-US "Override HECI-3 status on PCI"

#string STR_IE_IDERENABLE_PROMPT                #language en-US "IDER Enable"
#string STR_IE_IDERENABLE_HELP                  #language en-US "Override IDER status on PCI"
#string STR_IE_KTENABLE_PROMPT                  #language en-US "KT Enable"
#string STR_IE_KTENABLE_HELP                    #language en-US "Override KT status on PCI"


#string STR_IE_SVID_PROMPT                      #language en-US "Subsystem Vendor ID"
#string STR_IE_SVID_HELP                        #language en-US "Subsystem Vendor Id for IE device on PCI"
#string STR_IE_SID_PROMPT                       #language en-US "Subsystem ID"
#string STR_IE_SID_HELP                         #language en-US "Subsystem Id for IE device on PCI"

#string STR_IE_IENOTSUPPORTED_PROMPT            #language en-US "IE devices are not supported"
#string STR_IE_DFX_IE_FW_PROMPT                 #language en-US "Dfx IE FW detected. All IE devices on PCI enabled."
